app/Models/CategoriasModel.php

    public function getCategorias($id = false)

    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `categorias`