app/Models/CategoriesModel.php

    public function getCategoriesWithSubcategories(): array
    {
        // Realizamos la consulta para obtener las categorías y subcategorías
        $resultArray = $this->select('categories.id, categories.title AS category_title, subcategories.title AS subcategory_title, subcategories.description AS subcategory_description, subcategories.slug AS subcategory_slug')
            ->join('subcategories', 'categories.id = subcategories.category_id', 'left')->orderBy('categories.id, subcategories.id')
            ->get()
            ->getResultArray();
---
SELECT `categories`.`id`, `categories`.`title` AS `category_title`, `subcategories`.`title` AS `subcategory_title`, `subcategories`.`description` AS `subcategory_description`, `subcategories`.`slug` AS `subcategory_slug`
FROM `categories`
LEFT JOIN `subcategories` ON `categories`.`id` = `subcategories`.`category_id`
ORDER BY `categories`.`id`, `subcategories`.`id`