app/Models/SubcategoriesModel.php

SELECT `subcategories`.*
FROM `subcategories`
WHERE `subcategories`.`slug` = 'lactancia'
---
    public function getSubcategoryBySlug($subcategory_slug)

    {
        $resultArray = $this->select('subcategories.*')
            ->where('subcategories.slug', $subcategory_slug)
            ->get()
            ->getResultArray();

SELECT *
FROM `subcategories`
WHERE `category_id` = '1'
AND `subcategories`.`deleted_at` IS NULL
---
    public function getSubcategoriesByCategory($category_id)
    {
        return $this->where('category_id', $category_id)->findAll();

SELECT `subcategories`.`title`
FROM `subcategories`
WHERE `subcategories`.`slug` = 'lactancia'
---
    public function getTitle($slug): string
    {
        // Realizamos la consulta para obtener las categorías y subcategorías
        $resultArray = $this->select('subcategories.title')
            ->where('subcategories.slug', $slug)
            ->get()
            ->getResultArray();

SELECT `topics`.`title`, `topics`.`slug`, `users`.`username` AS `author`
FROM `subcategories`
LEFT JOIN `topics` ON `subcategories`.`id` = `topics`.`subcategory_id`
LEFT JOIN `users` ON `topics`.`author_id` = `users`.`id`
WHERE `subcategories`.`slug` = 'lactancia'
ORDER BY `topics`.`id`
---
    public function getSubcategoryTopics($slug): array
    {
        // Realizamos la consulta para obtener las categorías y subcategorías
        $resultArray = $this->select('topics.title, topics.slug, users.username AS author')
            ->join('topics', 'subcategories.id = topics.subcategory_id', 'left')->orderBy('topics.id')
            ->join('users', 'topics.author_id = users.id', 'left')  // JOIN con users usando author_id
            ->where('subcategories.slug', $slug)
            ->get()
            ->getResultArray();

SELECT `subcategories`.`title`, `subcategories`.`slug`, COUNT(topics.id) AS topic_count
FROM `subcategories`
LEFT JOIN `topics` ON `topics`.`subcategory_id` = `subcategories`.`id`
GROUP BY `subcategories`.`id`
ORDER BY `topic_count` DESC
 LIMIT 2
---
    public function getTrendingSubcategories($limit = 5)
    {
        return $this->select('subcategories.title, subcategories.slug, COUNT(topics.id) AS topic_count')
        ->join('topics', 'topics.subcategory_id = subcategories.id', 'left') // Unimos subcategories con topics
        ->groupBy('subcategories.id') // Agrupamos por subcategoría
        ->orderBy('topic_count', 'DESC') // Ordenamos por número de temas, descendente
        ->limit($limit) // Limitar el número de resultados
        ->get()
        ->getResultArray();