app/Models/UsuariosModel.php

    public function getUsuario($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `usuarios`